# Используем официальный образ Python
FROM python:3.12-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл с зависимостями
COPY requirements.txt .

# Устанавливаем зависимости (без кэша, чтобы образ был меньше)
RUN pip install  --no-cache-dir -r requirements.txt

# Копируем весь наш код
COPY . .

# Открываем порт, который будет слушать приложение
EXPOSE 8000

# Команда для запуска сервера
CMD ["uvicorn", "app.main:app", "--host", "0.0.0.0", "--port", "8000"]